---
type: AnalyticalLink
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 9
tags: [revit-api, class]
---

# AnalyticalLink

`Autodesk.Revit.DB.Structure.AnalyticalLink` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2013 | `public static AnalyticalLink Create ( Document doc , ElementId type , ElementId startHubId , ElementId endHubId )` |
| Method | IsAutoGenerated | 2013 | `public bool IsAutoGenerated ()` |
| Method | IsValidHub | 2013 | `public static bool IsValidHub ( Document doc , ElementId hubId )` |
| Property | End | 2013 | `public XYZ End { get ; }` |
| Property | EndHubId | 2013 | `public ElementId EndHubId { get ; }` |
| Property | OwnerId | 2013 | `public ElementId OwnerId { get ; }` |
| Property | Parameter | — | `` |
| Property | Start | 2013 | `public XYZ Start { get ; }` |
| Property | StartHubId | 2013 | `public ElementId StartHubId { get ; }` |